In [1]:
import pandas as pd

In [ ]:
import sqlalchemy

user= ''
password = ''
host=''
port = 
database=''
engine = sqlalchemy.create_engine(f"mysql://{user}:{password}@{host}:{port}/{database}")
df = pd.read_sql_query("select * from naver_day_stock where st_code = 'A005930'", con=engine)

In [9]:
df = pd.read_sql_query("select * from naver_day_stock where st_code = 'A005930'", con=engine)

In [20]:
# Moving Average 
# 30일 이동평균 
df['MA30'] = df['st_close'].rolling(30).mean()
df['MA5'] = df['st_close'].rolling(5).mean()

In [21]:
#df.drop("MV30", axis=1, inplace=True)

In [22]:
df.isnull().sum()

st_code      0
st_date      0
st_open      0
st_high      0
st_low       0
st_close     0
st_trade     0
MA30        29
MA5          4
dtype: int64

In [24]:
df.dropna(inplace=True)

In [ ]:
help(df.dropna)

In [28]:
import numpy as np 
type(np.nan)

float

In [30]:
np.array(['a', 'b', np.nan])

array(['a', 'b', 'nan'], dtype='<U32')

In [33]:
df.loc[5288 ,'MA30'] = np.nan

In [ ]:
#df.fillna(method='bfill')
# bfill , ffill 
df.ffill()

,st_code,st_date,st_open,st_high,st_low,st_close,st_trade,MA30,MA5
29,A005930,2004-02-09,10720,10920,10700,10860,452758,9886.000000,10432.0
30,A005930,2004-02-10,10940,11000,10760,10920,411416,9955.333333,10548.0
31,A005930,2004-02-11,11000,11180,10960,11080,608784,10030.000000,10728.0
32,A005930,2004-02-12,11200,11200,10920,10980,571000,10103.333333,10876.0
33,A005930,2004-02-13,10900,11100,10840,11100,335215,10179.000000,10988.0
...,...,...,...,...,...,...,...,...,...
5287,A005930,2025-05-23,55000,55200,54100,54200,11240044,55590.000000,55260.0
5288,A005930,2025-05-26,53900,55000,53700,54700,10901337,55590.000000,55040.0
5289,A005930,2025-05-27,54200,54500,53800,53900,13439520,55563.333333,54640.0
5290,A005930,2025-05-28,54300,56100,54200,55900,17514340,55586.666667,54680.0
5291,A005930,2025-05-29,56200,56400,55600,56100,12871624,55583.333333,54960.0

In [47]:
df.interpolate()

/tmp/ipykernel_851583/4002874584.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate()

,st_code,st_date,st_open,st_high,st_low,st_close,st_trade,MA30,MA5
29,A005930,2004-02-09,10720,10920,10700,10860,452758,9886.000000,10432.0
30,A005930,2004-02-10,10940,11000,10760,10920,411416,9955.333333,10548.0
31,A005930,2004-02-11,11000,11180,10960,11080,608784,10030.000000,10728.0
32,A005930,2004-02-12,11200,11200,10920,10980,571000,10103.333333,10876.0
33,A005930,2004-02-13,10900,11100,10840,11100,335215,10179.000000,10988.0
...,...,...,...,...,...,...,...,...,...
5287,A005930,2025-05-23,55000,55200,54100,54200,11240044,55590.000000,55260.0
5288,A005930,2025-05-26,53900,55000,53700,54700,10901337,55576.666667,55040.0
5289,A005930,2025-05-27,54200,54500,53800,53900,13439520,55563.333333,54640.0
5290,A005930,2025-05-28,54300,56100,54200,55900,17514340,55586.666667,54680.0
5291,A005930,2025-05-29,56200,56400,55600,56100,12871624,55583.333333,54960.0

In [58]:
(55590.000000 + 55563.333333) / 2

55576.6666665

In [46]:
[x for x in dir(df) if x.find("inter") > -1 ]

['_internal_names', '_internal_names_set', 'interpolate']

In [62]:
df['st_close'].ewm(span=20, adjust=False).mean()

29      10860.000000
30      10865.714286
31      10886.122449
32      10895.063168
33      10914.580962
            ...
5287    55750.318066
5288    55650.287774
5289    55483.593700
5290    55523.251443
5291    55578.179877
Name: st_close, Length: 5263, dtype: float64

In [63]:
df.duplicated()

29      False
30      False
31      False
32      False
33      False
        ...
5287    False
5288    False
5289    False
5290    False
5291    False
Length: 5263, dtype: bool

In [66]:
df.head(3)

,st_code,st_date,st_open,st_high,st_low,st_close,st_trade,MA30,MA5
29,A005930,2004-02-09,10720,10920,10700,10860,452758,9886.000000,10432.0
30,A005930,2004-02-10,10940,11000,10760,10920,411416,9955.333333,10548.0
31,A005930,2004-02-11,11000,11180,10960,11080,608784,10030.000000,10728.0

In [69]:
df['st_diff_1'] = df['st_close'].diff(1)

In [71]:
df['st_close'].shift(1)

29          NaN
30      10860.0
31      10920.0
32      11080.0
33      10980.0
         ...
5287    54700.0
5288    54200.0
5289    54700.0
5290    53900.0
5291    55900.0
Name: st_close, Length: 5263, dtype: float64